app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello, World!!!"], ["user_id", 6], ["created_at", "2016-02-22 19:12:02.768223"], ["updated_at", "2016-02-22 19:12:02.768223"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)